export function selfAssessmentTAB() {
  console.log(
    'РЕАЛИЗАЦИЯ ГЛАВНОЙ СТРАНИЦЫ ПРИЛОЖЕНИЯ в соответсвии с требованиями ТЗ (+реализован адаптив) 40 баллов: 1) главная страница содержит адаптивное меню с навигацией по страницам приложения. меню на всех страницах приложения - 10баллов; 2) описаны возможности и преимущества приложения. карточки в данном описании ссылки. они ведут на страницы, где реализован описанный функционал 10 баллов; 3)реализован раздел "О команде" с фото и ссылками на github всех участников команды, описан вклад в разработку приложения каждого из них 10 баллов; 4) на каждой странице приложения, кроме мини-игр отображается footer, содержащий указанные в ТЗ данные 10 баллов',
  );
  console.log(
    'РЕАЛИЗАЦИЯ СТРАНИЦЫ АВТОРИЗАЦИИ в соответсвии с требованиями ТЗ (+реализован адаптив) - 50 баллов: 1) реализована возможность входа в приложение без авторизации. при этом пользователю доступен ограниченный функционал: электронный учебник, мини-игры - 10 баллов. недоступные пункты меню скрыты; 2) реализована форма регистрации пользователя - 10 баллов; 3) реализована форма авторизации пользователя. Авторизованным пользователям доступен весь функционал приложения - 10 баллов; 4) реализована валидация формы авторизации и регистрации - 10 баллов; 5)реализована возможность разавторизации пользователя. Данные о авторизации при перезагрузке приложения сохраняются в localStorage - 10 баллов.',
  );
  console.log(
    'РЕАЛИЗАЦИЯ СТРАНИЦЫ СТАТИСТИКИ в соответствии с требованиями ТЗ - 100 баллов: реализована  КРАТКОСРОЧНАЯ СТАТИСТИКА - 60 баллов: 1) отражение статистики по мини-игре "Спринт" - 10 баллов; 2) отражение статистики по мини-игре "Аудиовызов" - 10 баллов; 3) отражение статистики по словам - 10 баллов; 4) реализована обработка ошибок при отрисовке статистики и вывод сообщений о ошибках - 10 баллов. 5) реализован адаптив для страницы - 10 балов; 6) реализовано взамодействие статистики с электронным учебником и играми - 10 баллов. ДОЛГОСТРОЧНАЯ СТАТИСТИКА - 40 баллов: 1) реализован график, отображающий количество новых слов за каждый день изучения - 10 баллов; реализован график, отбражающия количество изученных слов за период обучения по дням - 10 баллов; реализована обработка ошибок при отрисовки статистики - 10 баллов; реализована стилистическая настройка отображения данных в соответствии с общим стилем страницы - 10 баллов',
  );
}

export function selfAssessmentWhispermind() {
  console.log('');
}

export function selfAssessmentLenaRA() {
  console.log('');
}
